In [18]:
!pip install numpy
!pip install pandas

Requirement already satisfied: numpy in c:\users\pasindu senanayake\desktop\credit card approval prediction\model\env\lib\site-packages (1.23.4)
Requirement already satisfied: pandas in c:\users\pasindu senanayake\desktop\credit card approval prediction\model\env\lib\site-packages (1.5.0)
Requirement already satisfied: numpy>=1.21.0 in c:\users\pasindu senanayake\desktop\credit card approval prediction\model\env\lib\site-packages (from pandas) (1.23.4)
Requirement already satisfied: pytz>=2020.1 in c:\users\pasindu senanayake\desktop\credit card approval prediction\model\env\lib\site-packages (from pandas) (2022.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\pasindu senanayake\desktop\credit card approval prediction\model\env\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\users\pasindu senanayake\desktop\credit card approval prediction\model\env\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [19]:
import numpy as np
import pandas as pd

In [20]:
url = "https://raw.githubusercontent.com/SenanayakeX/FDM-Mini-Project/main/Data%20Set.csv"
data = pd.read_csv(url, encoding='latin-1')

In [21]:
data.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [26]:
data.shape

(438557, 13)

In [23]:
data = data.drop(columns=['ID', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE', 'FLAG_EMAIL'])

In [24]:
data.isnull().sum()

CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

In [25]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 13 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   CODE_GENDER          438557 non-null  object
 1   FLAG_OWN_CAR         438557 non-null  object
 2   FLAG_OWN_REALTY      438557 non-null  object
 3   CNT_CHILDREN         438557 non-null  int64
 4   AMT_INCOME_TOTAL     438557 non-null  float64
 5   NAME_INCOME_TYPE     438557 non-null  object
 6   NAME_EDUCATION_TYPE  438557 non-null  object
 7   NAME_FAMILY_STATUS   438557 non-null  object
 8   NAME_HOUSING_TYPE    438557 non-null  object
 9   DAYS_BIRTH           438557 non-null  int64
 10  DAYS_EMPLOYED        438557 non-null  int64
 11  OCCUPATION_TYPE      304354 non-null  object
 12  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(3), object(8)
memory usage: 43.5+ MB

In [65]:
bool_series = pd.notnull(data["OCCUPATION_TYPE"])
data = data[bool_series]

In [66]:
data.isnull().sum()

CODE_GENDER            0
FLAG_OWN_CAR           0
FLAG_OWN_REALTY        0
CNT_CHILDREN           0
AMT_INCOME_TOTAL       0
NAME_INCOME_TYPE       0
NAME_EDUCATION_TYPE    0
NAME_FAMILY_STATUS     0
NAME_HOUSING_TYPE      0
DAYS_BIRTH             0
DAYS_EMPLOYED          0
OCCUPATION_TYPE        0
CNT_FAM_MEMBERS        0
dtype: int64

In [67]:
data.shape

(304354, 13)

In [68]:
data.head()

,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,OCCUPATION_TYPE,CNT_FAM_MEMBERS
2,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,Security staff,2.0
3,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,Sales staff,1.0
4,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,Sales staff,1.0
5,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,Sales staff,1.0
6,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,Sales staff,1.0